#language: ru

@tree

Функционал: Верификация отчёта "Анализ выставленных актов"
Контекст:
	И я подключаю TestClient "Бухгалтер" логин "Бухгалтер" пароль ""
	И я закрываю все окна клиентского приложения
		
Сценарий: Сравнение отчёта за июнь 2025 с эталонными данными

	* Запуск отчёта "Анализ выставленных актов"
		И В командном интерфейсе я выбираю "Обслуживание клиентов" "Анализ выставленных актов"
		Тогда открылось окно "Анализ выставленных актов"
	* Конфигурирование параметров периода
		И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
		Тогда открылось окно "Выберите период"
		И в поле с именем 'DateBegin' я ввожу текст "01.06.2025"
		И в поле с именем 'DateEnd' я ввожу текст "30.06.2025"
		И я перехожу к следующему реквизиту
		И я нажимаю на кнопку с именем 'Select'
	* Инициирование формирования отчёта
		Тогда открылось окно "Анализ выставленных актов"
		И я нажимаю на кнопку с именем 'СформироватьОтчет'
	* Получение результатов анализа
		И я жду, что табличный документ 'ОтчетТабличныйДокумент' заполнится данными в течение 10 секунд
	* Верификация соответствия эталону
		Дано Табличный документ 'ОтчетТабличныйДокумент' равен макету "Эталон"


	


								
				